Yeah I see the issue. Thank you, @andrewhou-zonar, for reporting this.
Here is what I got. Three fields are incorrect
`region` ---> `zone`
`temp_gcs_location` ---> `tempLocation`
`template_gcs_path` ---> `gcsPath`
```
  # google_dataflow_job.hos_omi_audit_dataflow_job will be created
  + resource "google_dataflow_job" "hos_omi_audit_dataflow_job" {
      + id                = (known after apply)
      + job_id            = (known after apply)
      + labels            = {
          + "app"  = "my_app"
          + "env"  = "issue6961"
          + "team" = "hos"
        }
      + name              = "ssue6961hos-terraform-job"
      + on_delete         = "drain"
      + project           = (known after apply)
      + region            = "us-central1"
      + state             = (known after apply)
      + temp_gcs_location = "gs://coolbucket-dev/temp"
      + template_gcs_path = "gs://dataflow-templates-us-central1/latest/Cloud_PubSub_to_Cloud_PubSub"
      + type              = (known after apply)
    }
```

```
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5: POST /v1b3/projects/myproject/locations/us-central1/templates?alt=json&prettyPrint=false HTTP/1.1

2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5: {
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:  "environment": {
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:   "additionalUserLabels": {
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:    "app": "my_app",
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:    "env": "issue6961",
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:    "team": "hos"
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:   },
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:   "tempLocation": "gs://coolbucket-dev/temp",
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:   "zone": "us-central1-a"
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:  },
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:  "gcsPath": "gs://dataflow-templates-us-central1/latest/Cloud_PubSub_to_Cloud_PubSub",
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5:  "jobName": "ssue6961hos-terraform-job"
2020-08-12T19:51:51.074Z [DEBUG] plugin.terraform-provider-google_v3.34.0_x5: }
```